In [9]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Clean-up
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [10]:
df.loc[:, 'salary_year_avg':'salary_hour_avg']
median_salary_year = df['salary_year_avg'].median()
median_salary_hour = df['salary_hour_avg'].median()

In [14]:
df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)
df_filled.loc[:, 'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [17]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates()
print('length of original df: ', len(df_filled))
print('length of new df: ', len(df_unique))
print('Rows dropped: ', len(df_filled)-len(df_unique))

length of original df:  785741
length of new df:  785640
Rows dropped:  101

In [18]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])
print('length of original df: ', len(df_filled))
print('length of new df: ', len(df_unique))
print('Rows dropped: ', len(df_filled)-len(df_unique))

length of original df:  785741
length of new df:  508042
Rows dropped:  277699